<template lang="pug">
.hello-world 
    h2 Привет!
    h4 Это результат выполнения тестового задания для СовкомБанк
    p Задача:
    p Сделать приложение словарь с функционалом поиска и добавления в избранное. 
    ol
        li Поиск по первым и выдача первых 10 слов списком  
        li Сортировку списка осуществить в алфавитном порядке  
        li Если обозначение не влезает, обрезать его  
        li При клике на слово можно открыть и увидеть больше обозначений и транскрипцию  
        li Слова можно сохранять в избранное  
        li Сессия должна сохраняться и не сбрасываться при обновлении страницы и перезагрузке браузера  
        li На странице избранных слов можно поменять порядок слов перетаскиванием и удалить слово при клике на звездочку  
        li Поиск должен работать и в странице избранных слов  
        li Должен работать фильтр части речи 

    p Основная проблема была с выбором API для словаря. Все они не очень хорошо задокументированы. Oxford API не работает на клиенте. Wordnik требует 5$, либо ждать до семи дней. Я использовал условно-бесплатный Wordsapi, но пришлось ввести данные своей карты и стараться не превысить их бесплатные лимиты. Так что если хотите меня разорить, достаточно обращаться к API по 1000 раз в день! 😯 
    p Из-за спешки код получился не идеальным. Есть небольшие проблемы в верстке и с именованием классов и переменных. Будь чуть больше времени, я бы много чего исправил. 😓

    router-link(to="/app" tag="button") To the app!
</template>

<style lang="sass" scoped>
.hello-world
    width: 100% 
    max-width: 800px
    line-height: 26px

    button 
        cursor: pointer
        padding: 15px 25px
        border: none 
        background-color: #26A69A 
        color: white

</style>